{
	"Title": "Frequently Asked Questions",
	"Header": "Frequently Asked Questions",
	"FAQ_Para1": "If you have a question that isn't answered here, $1{email us} or ask in $2{our Discord}.",
	"Flash_Shutdown_Questions_Header": "Flash Shutdown Questions",
	"December_2020_Question": "Didn't all Flash games disappear after December 2020?",
	"December_2020_Answer_Para1": "Flash games don't disappear by themselves. However, since Flash support was $1{removed} from browsers, most people aren't able to play Flash content unless they downgrade their browser and Flash versions to one that does not contain the kill switch. While $2{Ruffle} has emerged as a viable solution for keeping Flash content online, it had major compatibility issues at the time of the shutdown and was not nearly as well-known. Because of this, many sites that hosted Flash games have decided to remove them. As we cannot rely on the assumption that these games will stay up, we're working hard to grab as many of them as possible while they're still here.",
	"Projector_Question": "Can't I just play Flash games using the standalone Flash Player projector?",
	"Projector_Answer_Para1": "Many web games have what is known as a $1{sitelock}, which means that they will not work unless they are being played on the original site they were hosted on. Since the projector is not connected to the internet and cannot identify those sites, those games will refuse to load on it. Moreover, web games are commonly spread across multiple files rather than just one; these are called $1{multi-asset} games, and often try to load other files through web URLs such that they are unlikely to run on their own with just the projector.",
	"Projector_Answer_Para2": "Flashpoint gets around both of these issues by running the games through a $1{local server proxy} which, simply put, tricks them into thinking they are being played on the live internet on their original sites they were meant to be played on.",
	"Wayback_Machine_Question": "Can't I just play Flash games using the Wayback Machine?",
	"Wayback_Machine_Answer_Para1": "The game has to be archived there in the first place, which may or may not happen. The Wayback Machine particularly struggles with grabbing games that use more than one file, so chances are that it will not work there. Games with sitelocks won't work there either, even if they are archived.",
	"HTML5_Question": "Weren't all of the Flash games converted to HTML5?",
	"HTML5_Answer_Para1": "No. HTML5 is an entirely different technology, so they can't be converted automatically. Developers could port them over to the platform, but most will not have the time or resources to do it. Besides, the capabilities of HTML5 are different from those of Flash, so a game ported to HTML5 will never be identical to the original.",
	"Project_Questions_Header": "Project Questions",
	"Safety_Question": "Is Flashpoint safe?",
	"Safety_Answer_Para1": "Yes. Each entry in the archive goes through multiple stages of approval before it is added, and the web technologies we support very rarely ever connect directly to the internet. Furthermore, all of the software we've built for Flashpoint, including the launcher, is $1{free and open-source}.",
	"Safety_Answer_Para2": "Regardless, a handful of antiviruses (notably Avast and AVG) detect important Flashpoint components as malware. These are false positives; if your antivirus is interfering with your Flashpoint copy, $1{read this page} for instructions on how to make an exception.",
	"Operating_Systems_Question": "What operating systems do you support?",
	"Operating_Systems_Answer_Para1": "Flashpoint primarily supports Windows 8.1 and newer. There are also versions for macOS and Linux, although they have fewer maintainers and lack some of the functionality of the Windows version. See the $1{download page} for more details.",
	"Chromebook_Question": "Can I use Flashpoint on a Chromebook?",
	"Chromebook_Answer_Para1": "Yes, but only if your Chromebook's processor architecture is x86_64; $1{this video} explains how to check. You'll also need to $2{install Linux on your Chromebook}, if you haven't done so yet.",
	"Chromebook_Answer_Para2": "Once you've verified your Chromebook's processor architecture and installed Linux, you can grab the Linux version of Flashpoint from the $1{download page}.",
	"Android_Question": "Can I use Flashpoint on Android?",
	"Android_Answer_Para1": "No, and there are a multitude of reasons why that is not feasible at the moment:",
	"Android_Answer_Bullet1": "The last version of Android to support and run Flash natively is 4.0 (Ice Cream Sandwich) which was released in 2011. Very few, if any, current devices can support this version of Android. Even if you were able to obtain a device running Android 4.0, installation of Flash would be impossible as the installer requires connecting to a now-defunct Adobe server.",
	"Android_Answer_Bullet2": "The vast majority of games in Flashpoint were designed to be viewed on desktop monitors and played with a keyboard and mouse, and would not be suitable for a handheld touchscreen.",
	"Android_Answer_Bullet3": "Flashpoint encompasses more than just Flash; bringing Flashpoint over to Android would also mean developing Android support for many other Flashpoint components (the launcher, proxy, etc.).",
	"Android_Answer_Bullet4": "While Android uses the Linux kernel, it is not a full-fledged Linux environment and lacks much of the same functionality that allows Flashpoint to run on Linux proper.",
	"Android_Answer_Bullet5": "All software in Flashpoint is written for the x86 architecture and is incompatible with ARM, which is the most common architecture on Android devices.",
	"Android_Answer_Para2": "That being said, our experimental site $1{9o3o} is able to play a subset of the archive via open-source emulators, although you may be limited to games that only use the mouse. Additionally, Ruffle has its own $2{native Android app}, allowing the majority of single-asset Flash titles to be played on mobile.",
	"Archive_Size_Question": "How many games/animations do you have?",
	"Archive_Size_Answer_Para1": "Flashpoint has preserved a grand total of $1{$2} games and animations as of $3. For more detailed statistics, head over to the $4{search page}.",
	"Other_Technologies_Question": "Do you preserve content made with technologies other than Flash (ie. HTML5)?",
	"Other_Technologies_Answer_Para1": "Yes, Flashpoint supports content made for over 100 web technologies in addition to Flash. They are all listed alongside their total entry counts on the $1{search page}.",
	"Searching_Question": "How can I check if a game/animation is in Flashpoint?",
	"Searching_Answer_Para1": "You can search the archive using our $1{online search tool}.",
	"Availability_Question": "Why can't I find a certain game/animation in Flashpoint?",
	"Availability_Answer_Para1": "First, double-check that you're spelling it right. Otherwise:",
	"Availability_Answer_Bullet1": "The entry might be marked as extreme, especially if it contains strong violence/language or NSFW imagery. If you are using the online search tool, you can unhide extreme entries by clicking the \"Show NSFW Entries\" checkbox. If you are using the launcher, see the $1{\"$2\"} FAQ entry.",
	"Availability_Answer_Bullet2": "The entry may not be allowed in Flashpoint. See our $1{Not Accepted Curations} wiki page to learn more.",
	"Availability_Answer_Bullet3": "The entry may not have been added yet. You can $1{request it}, although we highly recommend that you try to $2{add it yourself}.",
	"Nitrome_Question": "Where are the Nitrome games?",
	"Nitrome_Answer_Para1": "All of Nitrome's games were removed at their request. If you're looking to play their games, do so at $1{their website}, where nearly all of their games have been converted to HTML5.",
	"Nitrome_Answer_Para2": "We do not condone harassment or rude behavior towards Nitrome. They are well within their rights to request removal of their games; please respect that.",
	"Online_Multiplayer_Question": "Does Flashpoint support online multiplayer games?",
	"Online_Multiplayer_Answer_Para1": "No. Flashpoint does not provide capabilities for online multiplayer, and to do so would be a whole other project in itself. A handful of online multiplayer games with significant singleplayer content have been added to Flashpoint in that respect, but not without plenty of effort.",
	"Questionable_Content_Question": "Why is <questionable content> included in Flashpoint?",
	"Questionable_Content_Answer_Para1": "Web games and animations, like any other form of art, have always been used as a medium for indie developers to exercise their freedom of expression. This often includes homophobic, racist, sexist, and other objectionable content. As a preservation project, Flashpoint aims to archive as much content as possible from this era. It will not play the role of gatekeeper, so that future generations can see what these technologies were used for. All of these works are a snapshot in time and provide a window into what humans wanted to create when they were created. You do not have to agree with nor enjoy said content.",
	"Questionable_Content_Answer_Para2": "In order to responsibly provide the means to organize the vast collection that is Flashpoint, it is required to tag questionable content appropriately so that others may use search filters to exclude it from the rest.",
	"Questionable_Content_Answer_Para3": "With that being said, we do not archive illegal or borderline illegal content.",
	"Corrections_Question": "I found a game/animation with incorrect info. How do I go about fixing this?",
	"Corrections_Answer_Para1": "Let us know, either $1{by email} or through $2{our Discord}. Only project staff can perform metadata edits at the moment.",
	"Requesting_Question": "How can I request a game/animation?",
	"Requesting_Answer_Para1": "Read $1{this article} all the way through, then follow the links at the bottom. Note that submitting a request does not guarantee that the game or animation will be added in a timely manner; consider $2{adding it yourself} instead.",
	"Curating_Question": "How can I add a game/animation myself?",
	"Curating_Answer_Para1": "Follow the instructions listed in the $1{curation tutorial} to prepare your curator audition. Once it is approved, you can submit as many more curations as you desire.",
	"Contributing_Question": "I want to contribute in some other way (coding, testing, etc.). How can I help?",
	"Contributing_Answer_Para1": "Join $1{our Discord} for more details. The majority of our work and communication happens there.",
	"Donating_Question": "Where can I donate to the project?",
	"Donating_Answer_Para1": "Head over to $1{our Open Collective page}. All proceeds go towards covering our server costs.",
	"Logo_Question": "Can I use your logo? Is it available under Creative Commons?",
	"Logo_Answer_Para1": "Yes - the logo falls under the $1{CC-BY 4.0} license. See our $2{branding page} for more details.",
	"Removal_Requests_Question": "I want a game/animation removed from Flashpoint for one reason or another.",
	"Removal_Requests_Answer_Para1": "Alert us, either via $1{our Discord} or $2{directly by email}. We might try to convince you to let us keep your game or animation for historical sake, but we aren't unreasonable.",
	"Using_Flashpoint_Header": "Using Flashpoint",
	"Updating_Question": "How do I update Flashpoint?",
	"Updating_Answer_Para1": "If you are updating Flashpoint Infinity on Windows from version 12 or newer, you can update your local database using the large \"Update\" button in the top left corner of the launcher homepage. Meanwhile, software components can be updated through the $1{Flashpoint Manager}, which can be accessed by launching $2{$3} in your Flashpoint folder, or by clicking its button in the bottom left of the launcher. In the $1{Update Components} tab, you may review the software components that will be updated, and then click \"Install selected updates\" to initiate the update.",
	"Updating_Answer_Para2": "If you are updating Flashpoint Infinity on Windows from a version older than 12, or if you are updating from any version of Flashpoint on macOS or Linux, you will need to redownload. If you have any playlists you would like to transfer to the new version, click on them in the left sidebar and select the \"Export playlist to a file\" button (the second one from the left); in version 8.0 and older, they will always be exported to $1{$2} inside your Flashpoint folder. You can then import them into your new Flashpoint copy using the \"Import Playlists\" button at the bottom of the left sidebar.",
	"Updating_Answer_Para3": "If you are updating Flashpoint Ultimate on Windows, you can use the $1{Ultimate Updater} to fully upgrade your installation to the latest version of Ultimate.",
	"Release_Channels_Question": "Is there a nightly/bleeding-edge update channel?",
	"Release_Channels_Answer_Para1": "On Windows, there is a $1{Development} software update channel that receives more frequent updates than the default $1{Stable} update channel. To enable it, go to the $1{Settings} tab in the Flashpoint Manager and change the $1{Component Source} to \"Development\". Then click \"Save and Restart\" and perform an update.",
	"Release_Channels_Answer_Para2": "$1{WARNING:} Switching back to the Stable release channel may cause unpredictable results, and could permanently break your Flashpoint copy!",
	"Uninstalling_Question": "How do I uninstall Flashpoint?",
	"Uninstalling_Answer_Para1": "Since Flashpoint is a portable application, uninstallation is as easy as deleting your Flashpoint folder. However, because the Infinity installer on Windows can create shortcuts on the desktop and Start menu, you may instead want to use the \"Uninstall Flashpoint\" button in the Flashpoint Manager's settings, as this will automatically delete any shortcuts that were created.",
	"Reducing_Size_Question": "How can I reduce the size of my Flashpoint Infinity copy?",
	"Reducing_Size_Answer_Para1": "You can delete the contents of the following directories inside your Flashpoint folder, as they will be automatically repopulated if necessary:",
	"Reducing_Size_Answer_Bullet1": "(contains zipped entry data)",
	"Reducing_Size_Answer_Bullet2": "(contains legacy entry data)",
	"Reducing_Size_Answer_Bullet3": "(contains entry logos and screenshots)",
	"Reducing_Size_Answer_Para2": "You can also use the Flashpoint Manager to remove software components you do not need. In the $1{Add/Remove Components} tab, uncheck any components you would like to get rid of, and then click \"Apply changes\".",
	"Ultimate_Convert_Question": "Is it possible to convert my Flashpoint Infinity copy into an Ultimate copy?",
	"Ultimate_Convert_Answer_Para1": "Yes. Since Flashpoint Infinity and Ultimate are technologically identical - the only difference being that Ultimate contains all of the files that Infinity downloads on-demand - it is possible to effectively turn Infinity into Ultimate by simply overlaying files from Ultimate on top of the Infinity copy, even on macOS and Linux. Follow these instructions:",
	"Ultimate_Convert_Answer_Step1": "$1{Download Flashpoint Ultimate.} $2{$3} can be skipped, as it only contains software already present in Infinity for Windows, and should not be used on macOS and Linux.",
	"Ultimate_Convert_Answer_Step2": "Extract each zip file. A folder named $1{$2} will be created.",
	"Ultimate_Convert_Answer_Step3": "Move the inner contents of the Ultimate folder into your Infinity folder, allowing it to overwrite files if needed.",
	"Ultimate_Convert_Answer_Step4": "Delete the Ultimate folder.",
	"Ultimate_Convert_Answer_Para2": "If successfully performed, you will now have an offline-ready copy of Flashpoint.",
	"Playlists_Question": "How do I add or remove entries from a playlist?",
	"Playlists_Answer_Para1": "To add an entry to a playlist, simply click and drag the entry from your search view onto the desired playlist in the left sidebar; you can then drag around the entry within the playlist to rearrange it. To remove an entry from a playlist, select the entry from within the playlist and click the circled \"X\" button near the entry's title in the right sidebar.",
	"Playlists_Answer_Para2": "To edit a playlist's metadata, click on the playlist and then the pencil icon above the description. To delete a playlist, click the trash bin icon.",
	"Editing_Entries_Question": "How do I edit an entry in my copy of Flashpoint?",
	"Editing_Entries_Answer_Para1": "In the $1{Config} tab of the launcher, check the \"Enable Editing\" box. Now, when you select an entry, there will be a pencil and trash bin icon near the entry's title in the right sidebar. These allow you to edit and delete an entry, respectively.",
	"Missing_Sidebars_Question": "I can't see the left or right sidebar! Where did it go?",
	"Missing_Sidebars_Answer_Para1": "In the top right corner of the launcher underneath the window buttons, there are two toggles for the left and right sidebars. Click on them to show or hide the respective sidebar.",
	"Entry_Grid_Question": "How do I change the layout/size of the search results?",
	"Entry_Grid_Answer_Para1": "Use the slider in the bottom right corner of the launcher to change the size that search results are rendered at. Furthermore, the dropdown menu next to it can be used to switch from a grid-based layout to a list-based one.",
	"Recently_Played_Question": "Where can I view my recently played games?",
	"Recently_Played_Answer_Para1": "Next to the search bar, change the sort order to \"Last Played\" and the sort direction to \"Descending\". Note that playtime tracking must be enabled in order for this to work; if it isn't, go to the $1{Config} tab and check the \"Track Playtime\" box.",
	"Extreme_Content_Question": "How do I show/hide extreme content?",
	"Extreme_Content_Answer_Para1": "Most extreme content is hidden by default. To view your extreme filters, go to the $1{Config} tab and check the \"Show Extreme Filters\" box. Click the eye icon next to a filter to toggle it; a crossed-out eye means that entries which fall under the respective filter are hidden.",
	"Extreme_Content_Answer_Para2": "To forcefully disable extreme content from appearing in the launcher (for example, if you have children using Flashpoint), use a text editor to open the $1{$2} file in the root of your Flashpoint folder, and change the $1{$3} value next to $1{$4} to $1{$5}. Alternatively, to $6{permanently and irreversibly} remove all content belonging to a certain filter from your Flashpoint copy, click the trash bin icon next to the filter to nuke it.",
	"Miscellaneous_Questions_Header": "Miscellaneous Questions",
	"Entry_Location_Question": "Where are the downloaded entries stored?",
	"Entry_Location_Answer_Para1": "Most entries will be downloaded to $1{$2}, as self-contained zip files named after the entry's UUID. However, some older entries will instead be downloaded to $1{$3}, as loose files organized in a directory structure that resembles their original URLs.",
	"Save_Data_Location_Question": "Where is my save data stored? How can I delete it or transfer it to another computer/drive?",
	"Save_Data_Location_Answer_Para1": "See the $1{Save Data Locations} wiki page. If you have the $2{Saves Manager} component installed, you may use the batch scripts located in $3{$4} to manage your Flash save data. Use $3{$5} to export your saves to a $3{$6} folder, and $3{$7} to restore your saves from that same folder.",
	"Shortcuts_Question": "How do I make a shortcut to Flashpoint on my desktop/taskbar/Start menu?",
	"Shortcuts_Answer_Para1": "In File Explorer, navigate to the $1{$2} directory within your Flashpoint folder, then right-click $1{$3} and select \"Create Shortcut\". You can rename this shortcut and drag it to your desktop, taskbar, and/or Start menu.",
	"Entry_Shortcuts_Question": "How do I make a shortcut to a specific entry in Flashpoint?",
	"Entry_Shortcuts_Answer_Para1": "This feature will eventually be built into the launcher, but for now, follow the steps below:",
	"Entry_Shortcuts_Answer_Step1": "Download the $1{latest static release of CLIFp}.",
	"Entry_Shortcuts_Answer_Step2": "Extract the zip file and move $1{$2} into the root of your Flashpoint folder.",
	"Entry_Shortcuts_Answer_Step3": "Download the $1{Flashpoint Shortcut Maker}.",
	"Entry_Shortcuts_Answer_Step4": "Extract the zip file and move $1{$2} into the root of your Flashpoint folder.",
	"Entry_Shortcuts_Answer_Step5": "Open Flashpoint and find the entry you'd like to create a shortcut for.",
	"Entry_Shortcuts_Answer_Step6": "Right-click the entry and select \"Copy Game UUID\".",
	"Entry_Shortcuts_Answer_Step7": "Double-click $1{$2}.",
	"Entry_Shortcuts_Answer_Step8": "Paste the UUID of the entry that you copied in Step 6 and click \"OK\".",
	"Entry_Shortcuts_Answer_Para2": "If you've done everything right, a shortcut to the entry should appear on your desktop.",
	"LaunchBox_Question": "How can I add entries from Flashpoint to my LaunchBox collection?",
	"LaunchBox_Answer_Para1": "You can use $1{this tool} to import entries and playlists from Flashpoint into LaunchBox.",
	"Troubleshooting_Header": "Troubleshooting",
	"Troubleshooting_Para1": "Please see the $1{Troubleshooting page} on the wiki."
}