{
	"Title": "Source Code",
	"Header": "Source Code",
	"Source_Para1": "Flashpoint is powered by free and open-source software. Below you can find a list of projects developed by Flashpoint contributors; more can be found at our $1{GitHub team page}.",
	"Source_Para2": "Flashpoint also utilizes the following third-party open-source projects:",
	"CLIFp_Description": "A fully-featured command-line launcher for Flashpoint.",
	"Rust_Library_Description": "A library for interacting with Flashpoint's database that powers the launcher and the online search tool. Bindings for Node.js can be found $1{here}.",
	"Game_Server_Description": "A proxy server that tricks Flashpoint entries into thinking they are running on the live internet.",
	"Installer_Description": "An installer for Flashpoint Infinity.",
	"Launcher_Description": "An extensible Electron-based launcher that serves as the primary frontend for the archive.",
	"Manager_Description": "A utility for adding, removing, and updating Flashpoint's software components.",
	"Secure_Player_Description": "An advanced application that enables playback of plugin-based content without making permanent changes to the Windows registry.",
	"Ultimate_Updater_Description": "A utility for upgrading copies of Flashpoint Ultimate.",
	"Website_Description": "The very website you're looking at.",
	"FPFSS_Description": "The website that handles Flashpoint's curation submission and approval processes.",
	"FPCurator_Description": "A tool for managing and automatically generating Flashpoint curations.",
	"Old_CPU_Simulator_Description": "A utility that runs applications at simulated clock speeds; used to limit the framerate of games that run too fast on modern computers.",
	"Apache_Description": "A web server software used to run older Flashpoint entries that have not yet been made to use the modern Flashpoint Game Server.",
	"Basilisk_Description": "A web browser based on pre-Quantum Firefox that supports NPAPI plugins. The version included in Flashpoint is rebranded to $1{Flashpoint Navigator} due to licensing restrictions; its repository can be found $2{here}.",
	"Chromium_Description": "A modern web browser developed by Google, capable of running more recent and resource-heavy HTML5 content.",
	"MediaWiki_Description": "The software used to power the Flashpoint Wiki.",
	"PHP_Description": "A web scripting language used by numerous games in Flashpoint.",
	"Name": "Name",
	"License": "License",
	"Description": "Description",
	"No_License": "None",
	"Various_Licenses": "Various"
}